blogs/prometheus-disk-throughput.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-06-21 四 12:32 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>为prometheus测试磁盘吞吐量</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="root" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">为prometheus测试磁盘吞吐量</h1>
<p>
在使用prometheus的过程中，发现磁盘容量是个瓶颈。prometheus使用时间序列数据库，磁盘读写以顺序为主，磁盘的吞吐量是主要的考虑因素。当时有单块儿300G的SAS盘（10000转2.5英寸，14块）和单块儿6000G的SATA盘（7200转3.5英寸，12块，外加一个480G的SSD）两种盘，前者有raid卡，后者没有raid卡，只能用lvm做raid。
</p>

<p>
测试方式是：
</p>
<div class="org-src-container">

<pre class="src src-bash">dd <span style="color: #ffff00;">if</span>=/dev/zero <span style="color: #ffff00;">count</span>=10240000 <span style="color: #ffff00;">of</span>=/mnt/test/bigfile
<span style="color: #0000ff; font-weight: bold;">echo</span> 3 &gt; /proc/sys/vm/drop_caches &amp;&amp; <span style="color: #00ffff; font-weight: bold;">time</span> cat /mnt/test/bigfile &gt; /dev/null
</pre>
</div>

<p>
测试结果：
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">配置</th>
<th scope="col" class="org-left">耗时</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">SATA，SSD做缓存</td>
<td class="org-left">20.7s</td>
</tr>

<tr>
<td class="org-left">纯SSD</td>
<td class="org-left">20.6s</td>
</tr>

<tr>
<td class="org-left">SATA，条带化12 + SSD</td>
<td class="org-left">13.7s</td>
</tr>

<tr>
<td class="org-left">SATA，条带化12</td>
<td class="org-left">2.2s</td>
</tr>

<tr>
<td class="org-left">SAS，2块儿盘做RAID1</td>
<td class="org-left">27s</td>
</tr>

<tr>
<td class="org-left">SAS，14块儿盘做RAID5</td>
<td class="org-left">2.5s（观察到一个15s的，但没法复现）</td>
</tr>
</tbody>
</table>

<p>
基本可以确定用SSD做缓存，在吞吐量上弱于RAID，RAID的吞吐能力约等于单盘的吞吐能力*盘数量。SATA盘和SAS盘在吞吐量上差别不是很大。
</p>

<p>
最后选择了SAS盘，原因：
</p>
<ol class="org-ol">
<li>lvm做raid，lv创建好之后，啥也没干呢，用dstat观察，磁盘IO就开始飙升。</li>
<li>lvm做mirror，lv创建好后，磁盘IO用的少点，也有20-50M之多。</li>
<li>lvm做raid、mirror，不好维护，更换坏盘需要命令配合，便利性和raid卡没法比。</li>
<li>prometheus 做为监控系统，自身稳定可靠（好监控，好维护）比较重要。</li>
</ol>
</div>
<div id="postamble" class="status">
<p class="author">Author: root</p>
<p class="date">Created: 2018-06-21 四 12:32</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
